# UsGallons Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..UsGallons Property
UnitTypeId Class See Also
---
US gallons.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId UsGallons { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UsGallons As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ UsGallons {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace